'''
Напишіть програму, яка виводить двовимірну квадратну таблицю n x n чисел
(n - ціле число, яке вводить користувач). По головній діагоналі таблиці (від лівого верхнього
значення до нижнього правого значення) мають розміщуватися 0, вище головної діагоналі
розміщуються 1, а нижче - -1.Для гарного відображення таблиці при виведенні її
значень використовуйте символ табуляції \t.

Автор: Шарабар Ярослав Анатолійович
'''

n = int(input("Введіть розмір таблиці (ціле додатне число n): "))

if n <= 0:
    print("Введіть додатне число для розміру таблиці.")
else:
    
    for i in range(n):
        for j in range(n):
            if i < j:
                print("1", end='\t')
            elif i > j:
                print("-1", end='\t')
            else:
                print("0", end='\t')
        print()

